docs/loadtest-results/2026-07-27T09-58-55-625Z/k6-shard-1.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 98 max VUs, 1m0s max duration (incl. graceful stop):
              * mixed_components: 80.00 iterations/s for 30s (maxVUs: 26-98, gracefulStop: 30s)


running (0m01.0s), 02/26 VUs, 77 complete and 0 interrupted iterations
mixed_components   [   3% ] 02/26 VUs  01.0s/30s  80.00 iters/s

running (0m02.0s), 00/26 VUs, 158 complete and 0 interrupted iterations
mixed_components   [   7% ] 00/26 VUs  02.0s/30s  80.00 iters/s

running (0m03.0s), 01/26 VUs, 238 complete and 0 interrupted iterations
mixed_components   [  10% ] 01/26 VUs  03.0s/30s  80.00 iters/s

running (0m04.0s), 01/26 VUs, 318 complete and 0 interrupted iterations
mixed_components   [  13% ] 01/26 VUs  04.0s/30s  80.00 iters/s

running (0m05.0s), 00/26 VUs, 398 complete and 0 interrupted iterations
mixed_components   [  17% ] 00/26 VUs  05.0s/30s  80.00 iters/s

running (0m06.0s), 00/26 VUs, 478 complete and 0 interrupted iterations
mixed_components   [  20% ] 00/26 VUs  06.0s/30s  80.00 iters/s

running (0m07.0s), 01/26 VUs, 558 complete and 0 interrupted iterations
mixed_components   [  23% ] 01/26 VUs  07.0s/30s  80.00 iters/s

running (0m08.0s), 01/26 VUs, 638 complete and 0 interrupted iterations
mixed_components   [  27% ] 01/26 VUs  08.0s/30s  80.00 iters/s

running (0m09.0s), 01/26 VUs, 718 complete and 0 interrupted iterations
mixed_components   [  30% ] 01/26 VUs  09.0s/30s  80.00 iters/s

running (0m10.0s), 01/26 VUs, 798 complete and 0 interrupted iterations
mixed_components   [  33% ] 01/26 VUs  10.0s/30s  80.00 iters/s

running (0m11.0s), 01/26 VUs, 878 complete and 0 interrupted iterations
mixed_components   [  37% ] 01/26 VUs  11.0s/30s  80.00 iters/s

running (0m12.0s), 01/26 VUs, 958 complete and 0 interrupted iterations
mixed_components   [  40% ] 01/26 VUs  12.0s/30s  80.00 iters/s

running (0m13.0s), 01/26 VUs, 1038 complete and 0 interrupted iterations
mixed_components   [  43% ] 01/26 VUs  13.0s/30s  80.00 iters/s

running (0m14.0s), 01/26 VUs, 1118 complete and 0 interrupted iterations
mixed_components   [  47% ] 01/26 VUs  14.0s/30s  80.00 iters/s

running (0m15.0s), 01/26 VUs, 1198 complete and 0 interrupted iterations
mixed_components   [  50% ] 01/26 VUs  15.0s/30s  80.00 iters/s

running (0m16.0s), 01/26 VUs, 1278 complete and 0 interrupted iterations
mixed_components   [  53% ] 01/26 VUs  16.0s/30s  80.00 iters/s

running (0m17.0s), 01/26 VUs, 1358 complete and 0 interrupted iterations
mixed_components   [  57% ] 01/26 VUs  17.0s/30s  80.00 iters/s

running (0m18.0s), 01/26 VUs, 1438 complete and 0 interrupted iterations
mixed_components   [  60% ] 01/26 VUs  18.0s/30s  80.00 iters/s

running (0m19.0s), 01/26 VUs, 1518 complete and 0 interrupted iterations
mixed_components   [  63% ] 01/26 VUs  19.0s/30s  80.00 iters/s

running (0m20.0s), 01/26 VUs, 1598 complete and 0 interrupted iterations
mixed_components   [  67% ] 01/26 VUs  20.0s/30s  80.00 iters/s

running (0m21.0s), 01/26 VUs, 1678 complete and 0 interrupted iterations
mixed_components   [  70% ] 01/26 VUs  21.0s/30s  80.00 iters/s

running (0m22.0s), 01/26 VUs, 1758 complete and 0 interrupted iterations
mixed_components   [  73% ] 01/26 VUs  22.0s/30s  80.00 iters/s

running (0m23.0s), 01/26 VUs, 1838 complete and 0 interrupted iterations
mixed_components   [  77% ] 01/26 VUs  23.0s/30s  80.00 iters/s

running (0m24.0s), 01/26 VUs, 1918 complete and 0 interrupted iterations
mixed_components   [  80% ] 01/26 VUs  24.0s/30s  80.00 iters/s

running (0m25.0s), 02/26 VUs, 1997 complete and 0 interrupted iterations
mixed_components   [  83% ] 02/26 VUs  25.0s/30s  80.00 iters/s

running (0m26.0s), 01/26 VUs, 2078 complete and 0 interrupted iterations
mixed_components   [  87% ] 01/26 VUs  26.0s/30s  80.00 iters/s

running (0m27.0s), 01/26 VUs, 2158 complete and 0 interrupted iterations
mixed_components   [  90% ] 01/26 VUs  27.0s/30s  80.00 iters/s

running (0m28.0s), 01/26 VUs, 2238 complete and 0 interrupted iterations
mixed_components   [  93% ] 01/26 VUs  28.0s/30s  80.00 iters/s

running (0m29.0s), 01/26 VUs, 2318 complete and 0 interrupted iterations
mixed_components   [  97% ] 01/26 VUs  29.0s/30s  80.00 iters/s

running (0m30.0s), 01/26 VUs, 2398 complete and 0 interrupted iterations
mixed_components   [ 100% ] 01/26 VUs  30.0s/30s  80.00 iters/s


  █ TOTAL RESULTS 

    CUSTOM
    signals_accepted_202...........: 649    21.638871/s
    signals_rate_limited_429.......: 1752   58.414948/s
    signals_sampled_sent...........: 48     1.60041/s

    HTTP
    http_req_duration..............: avg=4.44ms min=766.41µs med=2.51ms max=66.06ms p(50)=2.51ms p(95)=13.24ms p(99)=32.89ms
      { expected_response:true }...: avg=4.44ms min=766.41µs med=2.51ms max=66.06ms p(50)=2.51ms p(95)=13.24ms p(99)=32.89ms
    http_req_failed................: 0.00%  0 out of 2401
    http_reqs......................: 2401   80.053819/s

    EXECUTION
    iteration_duration.............: avg=4.83ms min=941.38µs med=2.91ms max=66.8ms  p(50)=2.91ms p(95)=13.85ms p(99)=33.95ms
    iterations.....................: 2401   80.053819/s
    vus............................: 1      min=0         max=2 
    vus_max........................: 26     min=26        max=26

    NETWORK
    data_received..................: 2.7 MB 89 kB/s
    data_sent......................: 1.2 MB 39 kB/s



running (0m30.0s), 00/26 VUs, 2401 complete and 0 interrupted iterations
mixed_components ✓ [ 100% ] 00/26 VUs  30s  80.00 iters/s